export interface mailInfoData {
  id: number;
  receiver: string;
  title: string;
  date: string;
  content: string;
}

export const mailInfo: mailInfoData[] = [
  {
    id: 1,
    receiver: '전체',
    title: '행사 당일 체크인 관련 공지',
    date: '2025-03-24T15:00',
    content:
      '행사 당일 선착순 입장입니다.\n구매하신 티켓을 내 티켓 페이지에 해당 이벤트 정보를 누르면 QR코드를 확인할 수 있습니다.\n입장은 정시에 시작되며 재입장은 불가합니다.\n\n행사 당일 행사장 내에 주차는 불가하며 인근 유로 주차장이나 대중교통을 이용하시길 바랍니다.',
  },
  {
    id: 2,
    receiver: '일반',
    title: '행사 당일 체크인 관련 공지',
    date: '2025-05-24T12:15',
    content:
      '행사 당일 선착순 입장입니다.\n구매하신 티켓을 내 티켓 페이지에 해당 이벤트 정보를 누르면 QR코드를 확인할 수 있습니다.\n입장은 정시에 시작되며 재입장은 불가합니다.\n\n행사 당일 행사장 내에 주차는 불가하며 인근 유로 주차장이나 대중교통을 이용하시길 바랍니다.',
  },
  {
    id: 3,
    receiver: '무료',
    title: '행사 당일 체크인 관련 공지',
    date: '2025-02-11T10:30',
    content:
      '행사 당일 선착순 입장입니다.\n구매하신 티켓을 내 티켓 페이지에 해당 이벤트 정보를 누르면 QR코드를 확인할 수 있습니다.\n입장은 정시에 시작되며 재입장은 불가합니다.\n\n행사 당일 행사장 내에 주차는 불가하며 인근 유로 주차장이나 대중교통을 이용하시길 바랍니다.',
  },
  {
    id: 4,
    receiver: '일반',
    title: '행사 당일 체크인 관련 공지',
    date: '2025-01-24T15:45',
    content:
      '행사 당일 선착순 입장입니다.\n구매하신 티켓을 내 티켓 페이지에 해당 이벤트 정보를 누르면 QR코드를 확인할 수 있습니다.\n입장은 정시에 시작되며 재입장은 불가합니다.\n\n행사 당일 행사장 내에 주차는 불가하며 인근 유로 주차장이나 대중교통을 이용하시길 바랍니다.',
  },
  {
    id: 5,
    receiver: '무료',
    title: '행사 당일 체크인 관련 공지',
    date: '2025-07-27T09:30',
    content:
      '행사 당일 선착순 입장입니다.\n구매하신 티켓을 내 티켓 페이지에 해당 이벤트 정보를 누르면 QR코드를 확인할 수 있습니다.\n입장은 정시에 시작되며 재입장은 불가합니다.\n\n행사 당일 행사장 내에 주차는 불가하며 인근 유로 주차장이나 대중교통을 이용하시길 바랍니다.',
  },
  {
    id: 6,
    receiver: '전체',
    title: '행사 당일 체크인 관련 공지',
    date: '2025-01-14T11:10',
    content:
      '행사 당일 선착순 입장입니다.\n구매하신 티켓을 내 티켓 페이지에 해당 이벤트 정보를 누르면 QR코드를 확인할 수 있습니다.\n입장은 정시에 시작되며 재입장은 불가합니다.\n\n행사 당일 행사장 내에 주차는 불가하며 인근 유로 주차장이나 대중교통을 이용하시길 바랍니다.',
  },
];
